# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Brews
brew 'awscli'
brew 'awslogs'
brew 'coreutils'
brew 'curl'
brew 'dive' #docker image layer explorer
brew 'figlet'
brew 'findutils'
brew 'git'
brew 'git-lfs'
# brew 'gnu-tar', args: ["with-default-names"]
# brew 'gnu-sed', args: ["with-default-names"]
brew 'go'
brew 'gpg'
brew 'grep'
brew 'jq' # JSON for bash
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'less'
brew 'mas'
brew 'node'
brew 'openldap'
brew 'postgresql'
brew 'pv' # Copy progress tool
brew 'python'
# brew 'reattach-to-user-namespace' # TMUX patch for fixing copy/paste on macos
brew 'screen'
brew 'sqlite'
brew 'stress'
brew 'tfenv'
brew 'tflint'
brew 'trash'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zplug'
brew 'zsh'
brew 'zsh-completions'

# Casks
cask '1password-cli'
cask 'alfred'
cask 'brooklyn'
cask 'discord'
cask 'docker'
cask 'gimp'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'gpg-suite'
cask 'iterm2'
cask 'muzzle' # auto-enable do not disturb on screenshares
cask 'slack'
cask 'spotify'
cask 'steermouse' # Better than usb overdrive
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask "font-inconsolata-nerd-font"

# App Store Apps
# mas "Apple Developer", id: 640199958
# mas 'Xcode', id: 497799835