# What's on Tap
tap "fluxcd/tap"
tap "homebrew/bundle"

# Brews
brew "coreutils" # gnu utils
brew "cilium-cli" # CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "curl"    # gnu curl
brew 'dive'    # docker image layer explorer
brew 'findutils' # gnu find
brew "git"     # Keep git more updated than macos does
brew "gnupg"   # PGP
brew 'grep'    # gnu grep
brew "jq"      # JSON parser for shell
brew "k9s"     # Interactive shell for kubernetes
brew "kubernetes-cli" # Read better nerd
brew "kubectx"  # Context switcher for kubernetes
brew "mas"      # Connects brew to the app store
brew "neofetch" # System details
brew "opentofu" # Infrastructure as code
brew "pipx"     # Python package manager with virtualenv baked in
brew "pre-commit" # Hooks for git
brew "sops"     # Secret encryption
brew "starship" # The minimal, blazing-fast, and infinitely customizable prompt for any shell!
brew "trash"    # send files to trash
brew "yq" # YAML parser for bash
brew "zsh" #keep ZSH more up to date than macos does
brew 'zsh-completions'

# Casks
cask "1password"     # Password manager
cask "1password-cli" # CLI for 1pass
cask "alacritty"     # Faster terminal
cask "alfred"        # Better Spotlight + Automations
cask "discord"       # Chat App (When forums died the internet went with it)
cask "displaylink"   # For multiple monitors
cask "firefox"       # Browser
cask "google-chrome" # Worse Browser
cask "slack"         # Chat App (pretend professional)
cask "steam"         # Video Games
cask "visual-studio-code" # Sometimes IDEs are nice
cask "vlc"     # Video Player
cask "wifiman" # Ubiquiti VPN

# Font Casks
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# Macos Packages
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541