# What's on Tap
tap "homebrew/bundle"

# Brews
brew "git"     # Keep git more updated than macos does
brew "jq"      # JSON parser for bash
brew "k9s"     # Interactive shell for kubernetes
brew "kubernetes-cli" # Read better nerd
brew "kubectx" # Context switcher for kubernetes
brew "mas"     # Connects brew to the app store
brew "opentofu"   # Infrastructure as code
brew "pre-commit" # Hooks for git
brew "yq" # YAML parser for bash

# Casks
cask "1password" # Password manager
cask "alacritty" # Faster terminal
cask "alfred"    # Better Spotlight + Automations
cask "discord"   # Chat App (When forums died the internet went with it)
cask "displaylink" # For multiple monitors
cask "firefox" # Browser
cask "slack"   # Chat App (pretend professional)
cask "steam"   # Video Games
cask "visual-studio-code" # Sometimes IDEs are nice
cask "vlc" # Video Player
cask "wifiman" # Ubiquiti VPN