# Taps
tap "caskroom/cask"

# Brews
brew 'awscli'
brew 'bash'
brew 'bash-completion2'
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'gnupg2'
brew 'mas'
brew 'maven'
brew 'node'
brew 'python'
brew 'python3'
brew 'ruby'
brew 'salt'
brew 'screen'
brew 'stress'
brew 'terraform'
brew 'trash'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# Casks
cask 'alfred'
cask 'atom'
cask 'aws-vault'
cask 'deathtodsstore'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'magicprefs' #Magic mouse fix
cask 'meld'
cask 'pgadmin4'
cask 'pritunl'
cask 'private-internet-access'
cask 'slack'
cask 'spotify'
cask 'steam'
# cask 'usb-overdrive' # Maybe just install this one manually
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# App Store Apps
mas 'HyperDock', id: 449830122
mas 'LastPass', id: 926036361
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'PiPifier', id: 1160374471 # Add pip button to safari
mas 'Xcode', id: 497799835
