tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
cask 'java'
brew 'autoconf'
brew 'automake'
brew 'readline'
brew 'bash'
brew 'bash-completion'
brew 'gmp@4'
brew 'isl@0.12'
brew 'cloog'
brew 'coreutils'
brew 'libgpg-error'
brew 'libassuan'
brew 'libgcrypt'
brew 'libksba'
brew 'pth'
brew 'dirmngr'
brew 'openssl'
brew 'jpeg'
brew 'libpng'
brew 'libtiff'
brew 'wxmac'
brew 'erlang'
brew 'mpfr@2'
brew 'libmpc@0.8'
brew 'gcc@4.9'
brew 'gdbm'
brew 'gettext'
brew 'git'
brew 'pinentry'
brew 'gpg-agent'
brew 'libusb'
brew 'libusb-compat'
brew 'gnupg2'
brew 'htop'
brew 'icu4c'
brew 'libssh2'
brew 'libtool'
brew 'sqlite'
brew 'python'
brew 'libxml2'
brew 'libxslt'
brew 'libyaml'
brew 'mas'
brew 'maven'
brew 'mysql@5.6'
brew 'node@4'
brew 'phantomjs@1.92'
brew 'pkg-config'
brew 'qt5'
brew 'rabbitmq'
brew 'redis'
brew 'v8'
brew 'watch'
brew 'homebrew/dupes/libiconv'
cask 'chefdk'
cask 'java7'
cask 'vagrant'

#App Store Apps
mas 'HyperDock', id: 449830122
