# Taps
tap "caskroom/cask"

# Brews
brew 'automake'
brew 'autocong'
brew 'asdf'
brew 'antigen'
brew 'awscli'
brew 'bash'
brew 'bash-completion2'
brew 'coreutils'
brew 'findutils', args: ["with-default-names"]
brew 'git'
brew 'git-lfs'
brew 'gnupg'
brew 'gnupg2'
brew 'gnu-tar', args: ["with-default-names"]
brew 'gnu-sed', args: ["with-default-names"]
brew 'go', args: ["cross-compile-common"]
brew 'grep', args: ["with-default-names"]
brew 'imagemagick'
brew 'jq' # JSON for bash
brew 'kubectl'
brew 'kubectx'
brew 'kubernetes-helm'
brew 'lastpass-cli' ["with-pinentry"]
brew 'less'
brew 'libtool'
brew 'libxslt'
brew 'libyaml'
brew 'mas'
brew 'mkvtoolnix' # MKV file manipulation
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'pv' # Copy progress tool
brew 'python'
brew 'python3'
brew 'rbenv'
brew 'readline'
brew 'ruby'
brew 'salt'
brew 'screen'
brew 'stress'
brew 'terraform'
brew 'thefuck'
brew 'trash'
brew 'tree'
brew 'unixodbc'
brew 'unzip'
brew 'vim', args: ["with-override-system-vi"]
brew 'watch'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'zsh-completions'

# Casks
cask 'alfred'
cask 'android-file-transfer'
cask 'atom'
cask 'aws-vault'
cask 'deathtodsstore' # TODO: launch automatically in mac init
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'handylock'
cask 'gimp'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'magicprefs' # Magic mouse fix
cask 'meld'
cask 'minikube'
cask 'pgadmin4'
cask 'postico' # pgadmin alternative
cask 'postman' # rest api ui
cask 'pritunl' # openvpn altrernative client
cask 'private-internet-access'
cask 'slack'
cask 'steermouse' # Better than usb overdrive
cask 'spotify'
cask 'steam'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'zoomus' # video conferencing

# Needs java first
brew 'maven'

# App Store Apps
mas 'HyperDock', id: 449830122
mas 'LastPass', id: 926036361
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'PiPifier', id: 1160374471 # Add pip button to safari
mas 'Xcode', id: 497799835
