aws-scripting-guy.cform
dbaeumer.vscode-eslint
DotJoshJohnson.xml
eamodio.gitlens
eamodio.remotehub
fallenwood.vimL
formulahendry.code-runner
korekontrol.saltstack
lextudio.restructuredtext
mathiasfrohlich.Kotlin
mauve.terraform
ms-python.python
ms-vsliveshare.vsliveshare
PeterJausovec.vscode-docker
redhat.vscode-yaml
robertohuertasm.vscode-icons
sharat.vscode-brewfile
tht13.rst-vscode
wmaurer.change-case
yzhang.markdown-all-in-one