# Brews
brew 'expect'
brew 'figlet'

brew 'gpg'
brew 'kubernetes-helm'
brew 'less'
brew 'pv' # Copy progress tool
brew 'screen'
brew 'stress'
brew 'tfenv'
brew 'tflint'
brew 'tree'
brew 'unzip'
brew 'vim'
brew 'watch'
brew 'wget'
brew 'zplug'

# Casks

cask 'gimp'
cask 'google-cloud-sdk'
cask 'steermouse' # Better than usb overdrive
